extends Area2D
# ===========================================
# アイテム.
# ===========================================
# -------------------------------------------
# const.
# -------------------------------------------
const SPR_FRAME_OFS = 64 # 64から開始.

# -------------------------------------------
# onready.
# -------------------------------------------
@onready var _spr = $Sprite2D

# -------------------------------------------
# var.
# -------------------------------------------
## アイテムID.
var _id = Map.eType.NONE

# -------------------------------------------
# public functions.
# -------------------------------------------
## セットアップ.
## add_child()した後に呼びます.
func setup(id:Map.eType) -> void:
	_id = id
	_spr.frame = SPR_FRAME_OFS + _id - 1
	
# -------------------------------------------
# private functions.
# -------------------------------------------
func _physics_process(delta: float) -> void:
	_spr.offset.x = randf_range(-4, 4)
	_spr.offset.y = randf_range(-4, 4)
