extends Node2D
# ==============================================
# 実績データ.
# ==============================================

## 概要.
const TITLE = [
	"通常クリア",
	"ミニマムクリア",
	"コンプリート(?)クリア",
	"コンプリートクリア",
	"40秒クリア",
	"60秒クリア",
]

## 詳細.
const DETAIL = [
	"3種の神器を集める",
	"収集アイテムx3でクリアする",
	"収集アイテムx18でクリアする",
	"すべての収集アイテムを集める",
	"40秒以内でクリアする",
	"60秒以内でクリアする",
]

# ----------------------------------------------
# public functions.
# ----------------------------------------------
func get_title(id:Achievement.eType) -> String:
	return TITLE[id]
func get_detail(id:Achievement.eType) -> String:
	return DETAIL[id]
